In [7]:
import pandas as pd
import numpy as np

In [4]:
d = [["$229.2", 2017, 123000, "$1100", "Cupertino, US"],
     ["$211.9", 2017, 320671, "$284", "Suwon, South Korea"],
     ["$177.8", 2017, 566000, "$985",  "Seattle, US"],
     ["$154.7", 2017, 1300000, "$66", "New Taipei City, Taiwan"],
     ["$110.8", 2017, 80110, "$834", "Mountain View, US"]]

comps = ["apple", "samsung", "amazon", "foxconn", "alphabet"]
cols = ["revenue", "fy", "employees", "mcap", "location"]

c = pd.DataFrame(d, index=comps, columns=cols)

In [5]:
c

         revenue    fy  employees   mcap                 location
apple     $229.2  2017     123000  $1100            Cupertino, US
samsung   $211.9  2017     320671   $284       Suwon, South Korea
amazon    $177.8  2017     566000   $985              Seattle, US
foxconn   $154.7  2017    1300000    $66  New Taipei City, Taiwan
alphabet  $110.8  2017      80110   $834        Mountain View, US

In [7]:
rain = pd.DataFrame([[3.50, 4.53, 4.13, 3.98],
                     [7.91, 5.98, 6.10, 5.12],
                     [3.94, 5.28, 3.90, 4.49],
                     [1.42, 0.63, 0.75, 1.65]],
    index=['New York', 'New Orleans', 'Atlanta', 'Seattle'],
    columns=['Jun', 'Jul', 'Aug', 'Sept'])

In [8]:
rain

              Jun   Jul   Aug  Sept
New York     3.50  4.53  4.13  3.98
New Orleans  7.91  5.98  6.10  5.12
Atlanta      3.94  5.28  3.90  4.49
Seattle      1.42  0.63  0.75  1.65

what is the total rainfall for each month for all cities combined

In [15]:
rain.apply(lambda month: sum(month), axis = 0)

Jun     16.77
Jul     16.42
Aug     14.88
Sept    15.24
dtype: float64

what is the total rainfall for each city during the summer (all 4 months)?

In [18]:
rain.apply(lambda city : sum(city), axis = 0)

Jun     16.77
Jul     16.42
Aug     14.88
Sept    15.24
dtype: float64

In [23]:
rain.mean(axis = 'columns')

New York       4.0350
New Orleans    6.2775
Atlanta        4.4025
Seattle        1.1125
dtype: float64

In [24]:
rain.mean(axis = 'rows')

Jun     4.1925
Jul     4.1050
Aug     3.7200
Sept    3.8100
dtype: float64

In [26]:
rain.min(axis = 'rows')

Jun     1.42
Jul     0.63
Aug     0.75
Sept    1.65
dtype: float64

For each city, show the difference between the rainiest and least rainy summer month (that is, what's the difference between the max rain and the min rain?)

In [29]:
rain.apply(lambda city: city.max() - city.min(), axis='columns')

New York       1.03
New Orleans    2.79
Atlanta        1.38
Seattle        1.02
dtype: float64

In [31]:
pd.Series(['ant', 'cat', 'bat']).map(lambda word: word + 'ssss')

0    antssss
1    catssss
2    batssss
dtype: object

map, applymap

In [34]:
def factorial(n):
    return 1 if n == 0 else n * factorial(n - 1)

nums = pd.DataFrame(np.arange(9).reshape((3, 3)))
nums.applymap(factorial)

     0     1      2
0    1     1      2
1    6    24    120
2  720  5040  40320

using our rainfall data, convert every number from inches to centimeters (1 inch is about 2.5 cm) and add cm as a label (it's ok if all values are converted to strings)

In [37]:
rain.applymap(lambda inches: f'{inches * 2.5:.2f}cm')

                 Jun      Jul      Aug     Sept
New York      8.75cm  11.33cm  10.32cm   9.95cm
New Orleans  19.77cm  14.95cm  15.25cm  12.80cm
Atlanta       9.85cm  13.20cm   9.75cm  11.23cm
Seattle       3.55cm   1.57cm   1.88cm   4.12cm

In [40]:
c

         revenue    fy  employees   mcap                 location
apple     $229.2  2017     123000  $1100            Cupertino, US
samsung   $211.9  2017     320671   $284       Suwon, South Korea
amazon    $177.8  2017     566000   $985              Seattle, US
foxconn   $154.7  2017    1300000    $66  New Taipei City, Taiwan
alphabet  $110.8  2017      80110   $834        Mountain View, US

In [44]:
c['revenue'] = c['revenue'].map(lambda revenue: float(revenue[1:]))

In [45]:
c

          revenue    fy  employees   mcap                 location
apple       229.2  2017     123000  $1100            Cupertino, US
samsung     211.9  2017     320671   $284       Suwon, South Korea
amazon      177.8  2017     566000   $985              Seattle, US
foxconn     154.7  2017    1300000    $66  New Taipei City, Taiwan
alphabet    110.8  2017      80110   $834        Mountain View, US

In [46]:
c.sort_index()

          revenue    fy  employees   mcap                 location
alphabet    110.8  2017      80110   $834        Mountain View, US
amazon      177.8  2017     566000   $985              Seattle, US
apple       229.2  2017     123000  $1100            Cupertino, US
foxconn     154.7  2017    1300000    $66  New Taipei City, Taiwan
samsung     211.9  2017     320671   $284       Suwon, South Korea

In [51]:
c.sort_values(by='revenue', ascending = False)

          revenue    fy  employees   mcap                 location
apple       229.2  2017     123000  $1100            Cupertino, US
samsung     211.9  2017     320671   $284       Suwon, South Korea
amazon      177.8  2017     566000   $985              Seattle, US
foxconn     154.7  2017    1300000    $66  New Taipei City, Taiwan
alphabet    110.8  2017      80110   $834        Mountain View, US

show the data in ascending order based on revenue

In [52]:
c.sort_values(by='revenue')

          revenue    fy  employees   mcap                 location
alphabet    110.8  2017      80110   $834        Mountain View, US
foxconn     154.7  2017    1300000    $66  New Taipei City, Taiwan
amazon      177.8  2017     566000   $985              Seattle, US
samsung     211.9  2017     320671   $284       Suwon, South Korea
apple       229.2  2017     123000  $1100            Cupertino, US

add a column that shows revenue per employee, then show the company that has most revenue per employee (you can do this in multiple steps)

In [57]:
c['revenue_per_emp'] = c['revenue'] * 1000000 / c['employees']

In [59]:
c.sort_values(by = 'revenue_per_emp', ascending = False)

,revenue,fy,employees,mcap,location,revenue_per_emp
apple,229.2,2017,123000,$1100,"Cupertino, US",1863.414634
alphabet,110.8,2017,80110,$834,"Mountain View, US",1383.098240
samsung,211.9,2017,320671,$284,"Suwon, South Korea",660.801881
amazon,177.8,2017,566000,$985,"Seattle, US",314.134276
foxconn,154.7,2017,1300000,$66,"New Taipei City, Taiwan",119.000000

In [60]:
c.describe()

          revenue      fy     employees  revenue_per_emp
count    5.000000     5.0  5.000000e+00         5.000000
mean   176.880000  2017.0  4.779562e+05       868.089806
std     46.965807     0.0  4.981270e+05       736.015583
min    110.800000  2017.0  8.011000e+04       119.000000
25%    154.700000  2017.0  1.230000e+05       314.134276
50%    177.800000  2017.0  3.206710e+05       660.801881
75%    211.900000  2017.0  5.660000e+05      1383.098240
max    229.200000  2017.0  1.300000e+06      1863.414634

In [64]:
c.revenue.value_counts()

177.8    1
229.2    1
211.9    1
110.8    1
154.7    1
Name: revenue, dtype: int64

In [66]:
sdata = {'Ohio': 2500, 'Maryland': 240, 'NY':250}

In [69]:
obj3 = pd.Series(sdata)
obj3

Ohio        2500
Maryland     240
NY           250
dtype: int64

In [70]:
state = ['Cali', 'Maryland', 'Ohio','Utah']

In [72]:
obj4 = pd.Series(sdata, index=state)

In [73]:
obj4

Cali           NaN
Maryland     240.0
Ohio        2500.0
Utah           NaN
dtype: float64

In [78]:
obj4[obj4.notnull()]

Maryland     240.0
Ohio        2500.0
dtype: float64

In [80]:
obj4.name = 'population'

In [82]:
obj4.index.name = 'states'

In [83]:
obj4

states
Cali           NaN
Maryland     240.0
Ohio        2500.0
Utah           NaN
Name: population, dtype: float64

In [8]:
data = {'state': ['Ohio', 'Ohio','Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4]}

In [9]:
frame = pd.DataFrame(data)

In [10]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2  Nevada  2002  3.6
3  Nevada  2003  2.4

In [11]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2  Nevada  2002  3.6
3  Nevada  2003  2.4

In [12]:
pd.DataFrame(data,columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002  Nevada  3.6
3  2003  Nevada  2.4

In [13]:
pd.DataFrame(data,columns=['year', 'state', 'pop','extra'])

   year   state  pop extra
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002  Nevada  3.6   NaN
3  2003  Nevada  2.4   NaN

In [14]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [15]:
frame['state']

0      Ohio
1      Ohio
2    Nevada
3    Nevada
Name: state, dtype: object

In [16]:
frame.year

0    2000
1    2001
2    2002
3    2003
Name: year, dtype: int64

In [17]:
frame.index = ['one','two','three','four']

In [18]:
frame

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three  Nevada  2002  3.6
four   Nevada  2003  2.4

In [19]:
frame.loc['three']

state    Nevada
year       2002
pop         3.6
Name: three, dtype: object

In [20]:
frame['debt'] = 15.5

In [21]:
frame

        state  year  pop  debt
one      Ohio  2000  1.5  15.5
two      Ohio  2001  1.7  15.5
three  Nevada  2002  3.6  15.5
four   Nevada  2003  2.4  15.5

In [22]:
frame.reindex(['four', 'three','two', 'one'])

        state  year  pop  debt
four   Nevada  2003  2.4  15.5
three  Nevada  2002  3.6  15.5
two      Ohio  2001  1.7  15.5
one      Ohio  2000  1.5  15.5

In [23]:
cols = ['state', 'year', 'pop', 'debt']

In [24]:
frame.loc[['three', 'four', 'one', 'two'], cols]

        state  year  pop  debt
three  Nevada  2002  3.6  15.5
four   Nevada  2003  2.4  15.5
one      Ohio  2000  1.5  15.5
two      Ohio  2001  1.7  15.5

In [25]:
frame

        state  year  pop  debt
one      Ohio  2000  1.5  15.5
two      Ohio  2001  1.7  15.5
three  Nevada  2002  3.6  15.5
four   Nevada  2003  2.4  15.5

In [33]:
frame.iloc[[0,2], [3,0,1]]

       debt   state  year
one    15.5    Ohio  2000
three  15.5  Nevada  2002

In [39]:
frame

        state  year  pop  debt
one      Ohio  2000  1.5  15.5
two      Ohio  2001  1.7  15.5
three  Nevada  2002  3.6  15.5
four   Nevada  2003  2.4  15.5

In [43]:
frame.iloc[:,:2]

        state  year
one      Ohio  2000
two      Ohio  2001
three  Nevada  2002
four   Nevada  2003

In [41]:
frame.loc[:'four', :'debt']

        state  year  pop  debt
one      Ohio  2000  1.5  15.5
two      Ohio  2001  1.7  15.5
three  Nevada  2002  3.6  15.5
four   Nevada  2003  2.4  15.5

In [51]:
frame.loc['four':, :'debt']

       state  year  pop  debt
four  Nevada  2003  2.4  15.5

In [55]:
frame.iloc[[1,2],[3,0,1]]

       debt   state  year
two    15.5    Ohio  2001
three  15.5  Nevada  2002

In [56]:
frame

        state  year  pop  debt
one      Ohio  2000  1.5  15.5
two      Ohio  2001  1.7  15.5
three  Nevada  2002  3.6  15.5
four   Nevada  2003  2.4  15.5

In [58]:
frame.iloc[1:3, [3,0,1]]

       debt   state  year
two    15.5    Ohio  2001
three  15.5  Nevada  2002

In [117]:
frame.loc[:'three','pop']

one      1.5
two      1.7
three    3.6
Name: pop, dtype: float64

In [123]:
frame

        state  year  pop  debt
one      Ohio  2000  1.5  15.5
two      Ohio  2001  1.7  15.5
three  Nevada  2002  3.6  15.5
four   Nevada  2003  2.4  15.5

In [124]:
frame.iloc[:,:1]

        state
one      Ohio
two      Ohio
three  Nevada
four   Nevada

In [59]:
frame

        state  year  pop  debt
one      Ohio  2000  1.5  15.5
two      Ohio  2001  1.7  15.5
three  Nevada  2002  3.6  15.5
four   Nevada  2003  2.4  15.5

In [62]:
frame.sort_values(by='pop')

        state  year  pop  debt
one      Ohio  2000  1.5  15.5
two      Ohio  2001  1.7  15.5
four   Nevada  2003  2.4  15.5
three  Nevada  2002  3.6  15.5